---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShape.GetMultiplanarDefinition
source: html/9366f4cf-b2aa-3fd1-bdc0-984caeda0aaa.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.GetMultiplanarDefinition Method

The optional 3D structure of the shape.

## Syntax (C#)
```csharp
public RebarShapeMultiplanarDefinition GetMultiplanarDefinition()
```

## Returns
A copy of the multiplanar definition. Changes will not affect the RebarShape.